package SongBoard.main;

import java.util.Arrays;
import java.util.Collections;

public class Source {
	public String[] songs = 
		{"감사해요 깨닫지 못했었는데", "감사함으로 그 문에 들어가며", "갈급한 내맘", "내게 강 같은 평화", "내 눈 주의 영광을 보네"
			,"내 마음 다해 주 이름", "갈릴리마을 그 숲속에서", "내 모든 삶에 행동", "그사랑 얼마나","너의 가는 길에", 
			"기뻐하며 왕께 노래 부르리","내 평생 사는 동안","나는 주만 높이리", "너는 그리스도의 향기라", "나로부터 시작되리", 
			"너는 담장너머로 뻗은","나를 지으신 이가 하나님","너무 멀리 왔나요", "나를 향한 주의 사랑","다와서 찬양해",
			"나의 갈망은","당신은 사랑 받기 위해","나의 등 뒤에서","당신은 하나님의 언약 안에", "나의 맘 받으소서", 
			"두 손들고 찬양합니다","나의 발은 춤을 추며","따스한 성령님","내 모든 것 나의 생명까지","문들아 머리 들어라",
			"날마다 숨쉬는 순간마다","민족의 가슴마다","내 이름 아시죠","만세 반석","내 입술로",
			"물댄 동산","나를 지으신 주님","나 기뻐하리","밀알","마음이 상한 자를",
			"나 무엇과도 주님을","마지막 날에","나의 가장 낮은 마음","모든 능력과 모든 권세","나의 모습 나의 소유",
			"빛 되신 주 어둠 가운데","나 주님의 기쁨 되기","보혈을 지나","내 갈급함 어느 것으로"," 보라 새 일을",
			"빛의 군대","이 땅 위에 오신", "사망의 그늘에 앉아", "우리 오늘 눈물로","생명 주께 있네",
			"예수님 목마릅니다","세상 모든 민족이","주가 보이신 생명의 길","세상 흔들리고","주께 가오니",
			"사랑합니다 나의 예수님","주님 같은 반석은 없도다","산과 시내와 붉은 노을과","주님 내게 선하신 분","성령의 불타는 교회",
			"주님 한분 만으로","세상 흔들리고", "주 안에 우린 하나","손을 높이 들고",	"주의 자비가 내려와",
			"아름다운 마음들이 모여서","죽임 당하신 어린양","아바 아버지","주 이름 큰 능력 있도다","아버지 당신의 마음이",
			"주님 말씀하시면","언제나 내모습","지존하신 주님 이름 앞에","오직 주의 사랑에 매여","하나님께서 당신을 통해",
			"우리 모일 때","하나님께로 더 가까이","우리 보좌 앞에 모였네","하나님은 우리의 피난처가","우리 함께 기뻐해",
			"하나님은 너를 지키시는 자","유월절 어린양의 피로","하나님의 사랑을 사모하는","아침 안개 눈 앞 가리듯","형제의 모습 속에",
			"약할 때 강함 되시네","호산나","예수 나의 첫사랑 되시네","호흡 있는 만물","오소서 진리의 성령님",
			"힘돌고 지쳐 낙망하고", "이 땅의 황무함을 보소서","해뜨는데 부터","아무도 예배하지 않는","지금은 엘리야 때처럼"};
	public Source()
	{
		Collections.shuffle(Arrays.asList(songs));
	}
}
